In [1]:
import pandas as pd

In [2]:
hrdata=pd.read_csv("C:\\Users\\Sudip\\Desktop\\machine learning\\HR_comma_sep.csv")

In [3]:
hrdata.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,Department,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

In [4]:
df=hrdata.drop(['Work_accident','left',],axis=1)

In [5]:
df.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,promotion_last_5years,Department,salary
0,0.38,0.53,2,157,3,0,sales,low
1,0.80,0.86,5,262,6,0,sales,medium
2,0.11,0.88,7,272,4,0,sales,medium
3,0.72,0.87,5,223,5,0,sales,low
4,0.37,0.52,2,159,3,0,sales,low

In [6]:
from sklearn.preprocessing import LabelEncoder

In [7]:
le=LabelEncoder()

In [8]:
df.Department=le.fit_transform(df.Department)

In [9]:
df.salary=le.fit_transform(df.salary)

In [10]:
df.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,promotion_last_5years,Department,salary
0,0.38,0.53,2,157,3,0,7,1
1,0.80,0.86,5,262,6,0,7,2
2,0.11,0.88,7,272,4,0,7,2
3,0.72,0.87,5,223,5,0,7,1
4,0.37,0.52,2,159,3,0,7,1

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14999 entries, 0 to 14998
Data columns (total 8 columns):
satisfaction_level       14999 non-null float64
last_evaluation          14999 non-null float64
number_project           14999 non-null int64
average_montly_hours     14999 non-null int64
time_spend_company       14999 non-null int64
promotion_last_5years    14999 non-null int64
Department               14999 non-null int32
salary                   14999 non-null int32
dtypes: float64(2), int32(2), int64(4)
memory usage: 820.4 KB

In [12]:
df.columns[df.isna().any()]

Index([], dtype='object')

In [13]:
data=df.drop('promotion_last_5years',axis=1)

In [14]:
target=df['promotion_last_5years']

In [15]:
from sklearn.model_selection import train_test_split

In [16]:
x_train,x_test,y_train,y_test=train_test_split(data,target,train_size=.8,random_state=10)

In [17]:
x_train.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Department,salary
13388,0.85,0.81,4,260,3,6,2
6481,0.77,0.74,2,187,6,1,2
1494,0.17,0.75,3,188,4,9,1
2518,0.63,0.98,4,175,2,7,2
9958,0.91,0.59,5,179,3,3,1

In [18]:
y_train.head()

13388    0
6481     0
1494     0
2518     0
9958     0
Name: promotion_last_5years, dtype: int64

In [19]:
from sklearn.linear_model import LogisticRegression

In [20]:
model=LogisticRegression(solver='lbfgs',max_iter=200)

In [21]:
model.fit(x_train,y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=200,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [22]:
model.score(x_test,y_test)

0.975

In [23]:
model.predict(x_test[:5])

array([0, 0, 0, 0, 0], dtype=int64)

In [24]:
y_test[:5]

13982    0
822      0
13751    0
9656     0
13497    0
Name: promotion_last_5years, dtype: int64

In [25]:
hrdata.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,Department,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

In [26]:
df1=hrdata.drop(['promotion_last_5years','Work_accident'],axis=1)

In [27]:
df1.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,left,Department,salary
0,0.38,0.53,2,157,3,1,sales,low
1,0.80,0.86,5,262,6,1,sales,medium
2,0.11,0.88,7,272,4,1,sales,medium
3,0.72,0.87,5,223,5,1,sales,low
4,0.37,0.52,2,159,3,1,sales,low

In [28]:
df1.Department=le.fit_transform(df1.Department)

In [29]:
df1.salary=le.fit_transform(df1.salary)

In [30]:
df1.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,left,Department,salary
0,0.38,0.53,2,157,3,1,7,1
1,0.80,0.86,5,262,6,1,7,2
2,0.11,0.88,7,272,4,1,7,2
3,0.72,0.87,5,223,5,1,7,1
4,0.37,0.52,2,159,3,1,7,1

In [31]:
data1=df1.drop('left',axis=1)

In [32]:
target1=df1.left

In [33]:
x_train,x_test,y_train,y_test=train_test_split(data1,target1,train_size=.8,random_state=10)

In [34]:
x_train.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Department,salary
13388,0.85,0.81,4,260,3,6,2
6481,0.77,0.74,2,187,6,1,2
1494,0.17,0.75,3,188,4,9,1
2518,0.63,0.98,4,175,2,7,2
9958,0.91,0.59,5,179,3,3,1

In [35]:
y_train.head()

13388    0
6481     0
1494     1
2518     0
9958     0
Name: left, dtype: int64

In [36]:
from sklearn.ensemble import RandomForestClassifier

In [37]:
model1=RandomForestClassifier(n_estimators=100)

In [38]:
model1.fit(x_train,y_train)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
                       max_depth=None, max_features='auto', max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=100,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [39]:
model1.score(x_test,y_test)

0.988

In [40]:
hrdata.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,Department,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

In [41]:
df2=hrdata.drop(['promotion_last_5years','left'],axis=1)

In [42]:
df2.Department=le.fit_transform(df2.Department)

In [43]:
df2.salary=le.fit_transform(df2.salary)

In [44]:
df2.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,Department,salary
0,0.38,0.53,2,157,3,0,7,1
1,0.80,0.86,5,262,6,0,7,2
2,0.11,0.88,7,272,4,0,7,2
3,0.72,0.87,5,223,5,0,7,1
4,0.37,0.52,2,159,3,0,7,1

In [45]:
data2=df2.drop('Work_accident',axis=1)

In [46]:
target2=df2['Work_accident']

In [47]:
x_train,x_test,y_train,y_test=train_test_split(data2,target2,train_size=.8,random_state=10)

In [48]:
x_train.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Department,salary
13388,0.85,0.81,4,260,3,6,2
6481,0.77,0.74,2,187,6,1,2
1494,0.17,0.75,3,188,4,9,1
2518,0.63,0.98,4,175,2,7,2
9958,0.91,0.59,5,179,3,3,1

In [49]:
y_train.head()

13388    0
6481     0
1494     0
2518     0
9958     0
Name: Work_accident, dtype: int64

In [50]:
model2=RandomForestClassifier(n_estimators=100)

In [51]:
model2.fit(x_train,y_train)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
                       max_depth=None, max_features='auto', max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=100,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [52]:
model2.score(x_test,y_test)

0.884